# แบบฝึกหัด 2

---

จากข้อมูล titanic.csv ให้ทำการวิเคราะห์ข้อมูลเบื้องต้นเกี่ยวกับคอลัมน์ cabin  
โดยแผนภาพด้านล่างนี้เป็นตำแหน่งของ cabin ตามตัวอักษรตัวแรกของรหัส cabin ที่บันทึกในชุดข้อมูล

![titanic-cabin](https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Olympic_%26_Titanic_cutaway_diagram.png/800px-Olympic_%26_Titanic_cutaway_diagram.png)

ให้นิสิตสร้างคอลัมน์เพิ่ม โดยคอลัมน์ที่เพิ่มมานี้ จะเก็บข้อมูลของตัวอักษรตัวแรกที่ปรากฏในคอลัมน์ Cabin เช่น  
- หากในคอลัมน์ Cabin เป็นค่า "C123" ในคอลัมน์ที่สร้างจะบันทึก "C"  
- หากในคอลัมน์ Cabin เป็นค่า "C23 C25 C27" ในคอลัมน์ที่สร้างจะบันทึก "C"
- หากในคอลัมน์ Cabin เป็นค่า "B58 B60 C2" ในคอลัมน์ที่สร้างจะบันทึก "B"
- หากในคอลัมน์ Cabin เป็นค่า "F2" ในคอลัมน์ที่สร้างจะบันทึก "F"
- หากในคอลัมน์ Cabin เป็นค่า NaN ในคอลัมน์ที่สร้างจะบันทึก NaN

จากนั้นให้นิสิตเขียนโค้ดเพื่อตอบคำถามในแต่ละข้อ

In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/ThammakornS/ProgStat/main/dataset/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

นิสิตแสดงวิธีสร้างคอลัมน์

In [5]:
#your code
def get_cabin_to_letter(cabin):
    if pd.isna(cabin):
        return np.nan
    return cabin[0]

df['cabin_letter'] = df['Cabin'].apply(get_cabin_to_letter)
display(df)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_letter
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,B
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,NaN

1. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารกี่คน และมีจำนวน NaN เท่าไหร่

In [6]:
#your code
print(f"---{'cabin_letter'}---")
print(df['cabin_letter'].value_counts(dropna=False))
print("total passengers: ", df.shape[0])

---cabin_letter---
cabin_letter
NaN    687
C       59
B       47
D       33
E       32
A       15
F       13
G        4
T        1
Name: count, dtype: int64
total passengers:  891

2. ในแต่ละตัวอักษร Cabin มีจำนวนผู้โดยสารที่รอดและเสียชีวิตอย่างละเท่าไหร่ cabin ใดมีจำนวนผู้เสียชีวิตมากที่สุด

In [7]:
#your code
df_cabin_survive_count = pd.crosstab(df['cabin_letter'], df['Survived'])

# df_cabin_survive_count[0].max()
# highest_death_cabin = df_cabin_survive_count[0].idxmax()
# highest_death_count = df_cabin_survive_count[0].max()
# print(f"Highest death count is {highest_death_count} in cabin {highest_death_cabin}")

# Pattern 1
df_carbin_survive_sort = df_cabin_survive_count.sort_values(by=0, ascending=False)
df_carbin_survive_sort.head(1)

# Pattern 2
# df_cabin_survive_index = df_cabin_survive_count.index
# index_of_max_number = np.argmax(df_cabin_survive_count[0])
# df_cabin_survive_index[index_of_max_number]

Survived       0   1
cabin_letter
C             24  35

3. cabin ใดมีค่า สัดส่วน จำนวนผู้รอดชีวิตหารด้วยจำนวนผู้เสียชีวิต สูงสุด

In [8]:
#your code
df_carbin_survive_ratio = pd.crosstab(df['cabin_letter'], df['Survived'])
df_ratio = df_carbin_survive_ratio[1] / df_carbin_survive_ratio[0]
df_ratio = df_ratio.rename("survive_ratio")
df_ratio = df_ratio.reset_index()
df_ratio
# highest_survive_ratio = df_ratio['survive_ratio'].max()
# highest_survive_cabin = df_ratio[df_ratio['survive_ratio'] == highest_survive_ratio]['cabin_letter'].values[0]

# print(f"Highest survive ratio is {highest_survive_ratio} in cabin {highest_survive_cabin}")

  cabin_letter  survive_ratio
0            A       0.875000
1            B       2.916667
2            C       1.458333
3            D       3.125000
4            E       3.000000
5            F       1.600000
6            G       1.000000
7            T       0.000000

4. cabin ใดมีค่าเฉลี่ยราคาตั๋ว (Fare) สูงสุด

In [9]:
#your code
df_fare = df.filter(['cabin_letter', 'Fare']).groupby('cabin_letter').mean()

highest_cabin_fare = df_fare['Fare'].idxmax()
highest_cabin_fare_value = df_fare['Fare'].max()
print(f"Cabin highest average fare is {highest_cabin_fare} price {highest_cabin_fare_value}")

Cabin highest average fare is B price 113.50576382978724

5. จงแสดงค่าเฉลี่ยราคาตั๋ว (Fare) ของผู้รอดชีวิต และผู้เสียชีวิต ในแต่ละ cabin หากเปรียบเทียบราคาเฉลี่ยของผู้ที่รอดและเสียชีวิตจะพบว่า

In [10]:
#your code
df_survive_fare_filter = df.filter(['cabin_letter', 'Survived', 'Fare'])
df_survive_average_fare = df_survive_fare_filter.query("Survived != 0").groupby(['cabin_letter', 'Survived']).mean()
highest_survive_fare = df_survive_average_fare['Fare'].max()

df_death_average_fare = df_survive_fare_filter.query("Survived == 0").groupby(['cabin_letter', 'Survived']).mean()
highest_death_fare = df_death_average_fare['Fare'].max()

display(df_survive_average_fare)
print(f"Average fare of survive in each cabin: {highest_survive_fare}")
display(df_death_average_fare)
print(f"Average fare of dead in each cabin: {highest_death_fare}")
print(f"\nAverage fare of survive is higher than dead")

                             Fare
cabin_letter Survived
A            1          44.341071
B            1         132.832026
C            1         100.274046
D            1          58.356176
E            1          46.797050
F            1          23.294787
G            1          16.700000

Average fare of survive in each cabin: 132.83202571428572

                            Fare
cabin_letter Survived
A            0         35.496350
B            0         57.137500
C            0         99.972396
D            0         53.770825
E            0         43.715625
F            0         11.340000
G            0         10.462500
T            0         35.500000

Average fare of dead in each cabin: 99.97239583333334

Average fare of survive is higher than dead

6. ในแต่ละอักษร cabin มีจำนวนผู้โดยสารแยกตาม Pclass อย่างละกี่คน

In [11]:
#your code
pd.crosstab(df['cabin_letter'], df['Pclass'])

Pclass         1  2  3
cabin_letter
A             15  0  0
B             47  0  0
C             59  0  0
D             29  4  0
E             25  4  3
F              0  8  5
G              0  0  4
T              1  0  0